# main.py
# =========================================
#               Игорь Ковалев igorkov6@gmail.com
# SkillFactory: FPW-2.0
# Модуль:       C5 Итоговый проект по ООП
#               ИТОГОВЫЙ ПРОЕКТ 5.6 (PJ-02)
# project:      telegram bot
# interpreter:  Python 3.8
# ide:          PyCharm 2022.1
# =========================================
# в проекте учтены все требования задания
# с одним дополнением: при определении курса
# выполняется одновременно два запроса -
# прямой и инверсный.
# =========================================

from extensions import App

# -----------------------------------------------
# старт приложения
# -----------------------------------------------

App.run()

# -----------------------------------------------
